let financeData = [
        ["产品名称",
            "",
            "产品料号",
            "",
            "版本",
            "",
            "日期",
            ""
        ],
        ["1.材料",
            "",
            "",
            "",
            "",
            "记录",
            "是否需要客户反馈",
            "反馈结果"
        ],
        ["1.1 材料规格是什么?",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["1.2 材料在厂内是否有类似使用经验?如有，是哪些经验？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["1.3 材料是否对生产贮存过程特殊要求?如有，是哪些特殊要求？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["1.4 材料交付周期是多少天？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["1.5 是否可以使用回料？如可以，比例是多少？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["1.6 是否需要提供第三方材料测试？如果有，频率是多少？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.尺寸",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.1 视角及基准是否明确定义？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.2 关键尺寸CTF和SPC尺寸是否有标识? 如有，有哪些关键尺寸或SPC尺寸？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.3 所有公差是否均有定义，如使用通用公差，标准是什么?",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.4 重点尺寸的精度和测量手段是否可以实现？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.5 所有尺寸标识是否清晰？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.6 是否有难以测量或测量误差较大的尺寸？如有，有哪些尺寸？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.7 需要哪些测量工具进行测量？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.8 测量的方案，工具，检具，仪器，是否已经预先定义并规划在DFM？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.9 图纸是否有单向公差？是否被识别？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["2.10 产品尺寸是否都有编号？如没有，我方需要增加",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["3.产品功能",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["3.1 产品功能是什么？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["3.2 功能面是否定义?",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["3.3 图纸是否包含镜像件？镜像件的品名与料号是否清楚明确？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["3.4 是否有功能测试要求，如有,则测试标准，测试条件是什么？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["3.5 产品是否要求后续工艺处理？如有，后续工艺是什么？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["4.标注",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["4.1 所有标注均已理解？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["4.2 标注中有哪些重要特性标注？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["4.3 标注中所有提及的标准规范是什么？是否进行受控发行？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["4.4 对产品刻字标识是哪些要求？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["4.5 图纸的版本号是多少？客户端受控日期是多少？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["4.6 图纸内容是否显示清晰？如不清晰，请记录",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["5.其它",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["5.1 产品在生产过程中是否会有防错的需要？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["5.2 产品外观是否有特殊要求？如有，是什么？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["5.3 产品包装是否有特殊要求？如有，是什么？（分穴，真空等）",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["5.4 产品制造、测量、储存、运输是否对环境有特殊要求？，如有，是什么？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["5.5 为产品实现是否需要其它资源？如特殊技能，专利等",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["5.6 是否为对手件的产品？如是，区分和标识如何定义的？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        ["5.7 是否在产品上有制定浇口、分型面等？如是，有哪些要求？",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ];


    let mergeCells =
         [{
                "row": 1,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 2,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 3,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 4,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 5,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 6,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 7,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 8,
                "col": 0,
                "rowspan": 1,
                "colspan": 8
            },
            {
                "row": 9,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 10,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 11,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 12,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 13,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 14,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 15,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 16,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 17,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 18,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 19,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 20,
                "col": 0,
                "rowspan": 1,
                "colspan": 8
            },
            {
                "row": 21,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 22,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 23,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 24,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 25,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 26,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 27,
                "col": 0,
                "rowspan": 1,
                "colspan": 8
            },
            {
                "row": 28,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 29,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 30,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 31,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 32,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 33,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 34,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 35,
                "col": 0,
                "rowspan": 1,
                "colspan": 8
            },
            {
                "row": 36,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 37,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 38,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 39,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 40,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 41,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 42,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            },
            {
                "row": 43,
                "col": 0,
                "rowspan": 1,
                "colspan": 5
            }
        ]
    